virtualabs/cutcutgo/src/packs/ATSAMA5D27CLD2G_DFP/component/rtc.h
/*
 * Component description for RTC
 *
 * Copyright (c) 2021 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2021-06-28T09:00:02Z */
#ifndef _SAMA5D2_RTC_COMPONENT_H_
#define _SAMA5D2_RTC_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR RTC                                          */
/* ************************************************************************** */

/* -------- RTC_TSTR : (RTC Offset: 0x00) ( R/ 32) TimeStamp Time Register 0 -------- */
#define RTC_TSTR_SEC_Pos                      _U_(0)                                               /**< (RTC_TSTR) Seconds of the Tamper Position */
#define RTC_TSTR_SEC_Msk                      (_U_(0x7F) << RTC_TSTR_SEC_Pos)                      /**< (RTC_TSTR) Seconds of the Tamper Mask */
#define RTC_TSTR_SEC(value)                   (RTC_TSTR_SEC_Msk & ((value) << RTC_TSTR_SEC_Pos))  
#define RTC_TSTR_MIN_Pos                      _U_(8)                                               /**< (RTC_TSTR) Minutes of the Tamper Position */
#define RTC_TSTR_MIN_Msk                      (_U_(0x7F) << RTC_TSTR_MIN_Pos)                      /**< (RTC_TSTR) Minutes of the Tamper Mask */
#define RTC_TSTR_MIN(value)                   (RTC_TSTR_MIN_Msk & ((value) << RTC_TSTR_MIN_Pos))  
#define RTC_TSTR_HOUR_Pos                     _U_(16)                                              /**< (RTC_TSTR) Hours of the Tamper Position */
#define RTC_TSTR_HOUR_Msk                     (_U_(0x3F) << RTC_TSTR_HOUR_Pos)                     /**< (RTC_TSTR) Hours of the Tamper Mask */
#define RTC_TSTR_HOUR(value)                  (RTC_TSTR_HOUR_Msk & ((value) << RTC_TSTR_HOUR_Pos))
#define RTC_TSTR_AMPM_Pos                     _U_(22)                                              /**< (RTC_TSTR) AM/PM Indicator of the Tamper Position */
#define RTC_TSTR_AMPM_Msk                     (_U_(0x1) << RTC_TSTR_AMPM_Pos)                      /**< (RTC_TSTR) AM/PM Indicator of the Tamper Mask */
#define RTC_TSTR_AMPM(value)                  (RTC_TSTR_AMPM_Msk & ((value) << RTC_TSTR_AMPM_Pos))
#define RTC_TSTR_TEVCNT_Pos                   _U_(24)                                              /**< (RTC_TSTR) Tamper Events Counter Position */
#define RTC_TSTR_TEVCNT_Msk                   (_U_(0xF) << RTC_TSTR_TEVCNT_Pos)                    /**< (RTC_TSTR) Tamper Events Counter Mask */
#define RTC_TSTR_TEVCNT(value)                (RTC_TSTR_TEVCNT_Msk & ((value) << RTC_TSTR_TEVCNT_Pos))
#define RTC_TSTR_BACKUP_Pos                   _U_(31)                                              /**< (RTC_TSTR) System Mode of the Tamper Position */
#define RTC_TSTR_BACKUP_Msk                   (_U_(0x1) << RTC_TSTR_BACKUP_Pos)                    /**< (RTC_TSTR) System Mode of the Tamper Mask */
#define RTC_TSTR_BACKUP(value)                (RTC_TSTR_BACKUP_Msk & ((value) << RTC_TSTR_BACKUP_Pos))
#define RTC_TSTR_Msk                          _U_(0x8F7F7F7F)                                      /**< (RTC_TSTR) Register Mask  */

/* UTC mode */
#define RTC_TSTR_UTC_Msk                      _U_(0x00000000)                                       /**< (RTC_TSTR_UTC) Register Mask  */


/* -------- RTC_TSDR : (RTC Offset: 0x04) ( R/ 32) TimeStamp Date Register 0 -------- */
#define RTC_TSDR_CENT_Pos                     _U_(0)                                               /**< (RTC_TSDR) Century of the Tamper Position */
#define RTC_TSDR_CENT_Msk                     (_U_(0x7F) << RTC_TSDR_CENT_Pos)                     /**< (RTC_TSDR) Century of the Tamper Mask */
#define RTC_TSDR_CENT(value)                  (RTC_TSDR_CENT_Msk & ((value) << RTC_TSDR_CENT_Pos))
#define RTC_TSDR_YEAR_Pos                     _U_(8)                                               /**< (RTC_TSDR) Year of the Tamper Position */
#define RTC_TSDR_YEAR_Msk                     (_U_(0xFF) << RTC_TSDR_YEAR_Pos)                     /**< (RTC_TSDR) Year of the Tamper Mask */
#define RTC_TSDR_YEAR(value)                  (RTC_TSDR_YEAR_Msk & ((value) << RTC_TSDR_YEAR_Pos))
#define RTC_TSDR_MONTH_Pos                    _U_(16)                                              /**< (RTC_TSDR) Month of the Tamper Position */
#define RTC_TSDR_MONTH_Msk                    (_U_(0x1F) << RTC_TSDR_MONTH_Pos)                    /**< (RTC_TSDR) Month of the Tamper Mask */
#define RTC_TSDR_MONTH(value)                 (RTC_TSDR_MONTH_Msk & ((value) << RTC_TSDR_MONTH_Pos))
#define RTC_TSDR_DAY_Pos                      _U_(21)                                              /**< (RTC_TSDR) Day of the Tamper Position */
#define RTC_TSDR_DAY_Msk                      (_U_(0x7) << RTC_TSDR_DAY_Pos)                       /**< (RTC_TSDR) Day of the Tamper Mask */
#define RTC_TSDR_DAY(value)                   (RTC_TSDR_DAY_Msk & ((value) << RTC_TSDR_DAY_Pos))  
#define RTC_TSDR_DATE_Pos                     _U_(24)                                              /**< (RTC_TSDR) Date of the Tamper Position */
#define RTC_TSDR_DATE_Msk                     (_U_(0x3F) << RTC_TSDR_DATE_Pos)                     /**< (RTC_TSDR) Date of the Tamper Mask */
#define RTC_TSDR_DATE(value)                  (RTC_TSDR_DATE_Msk & ((value) << RTC_TSDR_DATE_Pos))
#define RTC_TSDR_Msk                          _U_(0x3FFFFF7F)                                      /**< (RTC_TSDR) Register Mask  */

/* UTC mode */
#define RTC_TSDR_UTC_Msk                      _U_(0x00000000)                                       /**< (RTC_TSDR_UTC) Register Mask  */


